Repository: ded-otshelnik/nnmd
Catalog: docs/locale/*/LC_MESSAGES/bpnn.po
Languages: ru

source: Behler-Parrinello Neural Network
ru: Нейронная сеть Белера-Парринелло

source: **Behler-Parrinello Neural Network (BPNN)** is a type of neural network specifically designed to approximate potential energy surfaces in molecular dynamics simulations :cite:`bpnn, behler2021`.
ru: Нейронная сеть Белера-Парринелло (Behler-Parrinello Neural Network - BPNN) представляет собой особый тип нейронных сетей, которые специально созданы, чтобы аппроксимировать межатомные потенциалы в молекулярно-динамических экспериментах :cite:`bpnn, behler2021`.

source: It uses special architecture called **High-Dimensional Neural Network (HDNN)** that contains 2 main parts: 1. **Symmetry Functions** - to encode the local environment of atoms in a system. 2. Subnets - **Atomic Networks (AtomicNN)** - for each sort of atoms (chemical species) in the system.
ru: BPNN является **нейронной сетью высокой размерности (High-Dimensional Neural Network - HDNN)**, которая состоит из двух частей:1. **Функции симметрии** - для описания локального окружения атомов системы. 2. Подсети - **Атомные сети (AtomicNN)** - для каждого сорта атомов (химических элементов) в системе.

source: The BPNN architecture is a generalization of the Behler-Parrinello approach to neural networks, which allows for the representation of complex potential energy surfaces in high-dimensional spaces.
ru: Архитектура BPNN - генерализация подхода Белера-Парринелло к нейронным сетям, позволяющий представлять сложные поверхности потенциальной энергии в пространствах высокой размерности.

source: Plot of schematic Behler-Parrinello-Neural-Network architecture.
ru: Схема архитектуры BPNN

source: Atomic-Centered Symmetry Functions
ru: Атомно-центрированные функции симметрии

source: For the BPNN to work, it is necessary to encode the local environment of atoms in a system. This is done using **Atomic-Centered Symmetry Functions (ACSF)** :cite:`acsf` that is used as an input to the network.
ru: Чтобы BPNN могла успешно применяться, необходимо описать локальное окружение атомов системы. Это достигается через применение **атомно-центрированных симметричных функций (функций Белера-Парринелло)** :cite:`acsf`, которые используются как входные значения нейронной сети.

source: ACSFs are designed to be invariant to translations, rotations, and permutations of atoms in the system so it encodes uniquely the local environment of each atom. There are two types of ACSFs: 1. **Radial Functions** - depend only on the distance between atoms.
ru: Функции Белера-Парринелло сделаны так, чтобы они были инвариантны относительно ротации, трансляции и перестановки атомов одного сорта и при этом уникальным образом описывали локальное окружение каждого атома. Существует два типа таких функций: 1. **Радиальные функции** - зависят только от межатомных расстояний.

source: where :math:`f_c` is a cutoff function that can be defined as:
ru: где :math:`f_c` является функцией отсечки, определяемой следующим образом:

source: **Angular Functions** - depend on the angles between bonds.
ru: **Угловые функции** - помимо расстояний учитываются углы между связями."
