Repository: ded-otshelnik/nnmd
Catalog: docs/locale/*/LC_MESSAGES/api/nnmd.*.po
Languages: nn

source: Module `nnmd.nn` provides neural network functionalities for molecular dynamics simulations.
nn: Модуль `nnmd.nn` предоставляет функционал нейронных сетей для молекулярно-динамических симуляций.

source: Bases: :py:class:`~torch.nn.modules.module.Module`
nn: Базовые классы: :py:class:`~torch.nn.modules.module.Module`

source: Model implements a multilayer perceptron for one species with a single output for one atom.
nn: Модель реализует многослойный перцептрон для одного вида с одним выходом для одного атома.

source: Define the computation performed at every call.
nn: Определяет вычисления, выполняемые при каждом вызове.

source: Should be overridden by all subclasses.
nn: Должен быть переопределен всеми подклассами.

source: Although the recipe for forward pass needs to be defined within this function, one should call the :class:`Module` instance afterwards instead of this since the former takes care of running the registered hooks while the latter silently ignores them.
nn: Хотя рецепт прямого прохода должен быть определен в этой функции, следует вызвать экземпляр :class:`Module` вместо этого, поскольку первый заботится о запуске зарегистрированных хуков, в то время как второй тихо игнорирует их.

source: Class implement high-dimentional NN for system of atoms.
nn: Класс реализует высокоразмерную нейронную сеть для системы атомов.

source: For each atom it defines special Atomic NN which provide machine-trained potentials.
nn: Для каждого атома он определяет специальную атомную нейронную сеть, которая предоставляет машиннообученные потенциалы.

source: Configures BPNN instance.
nn: Настраивает экземпляр BPNN.

source: Parameters
nn: Параметры

source: data about BPNN and its atomic subnets
nn: данные о BPNN и его атомных подсетях

source: Train method of neural network.
nn: Метод обучения нейронной сети.

source: input dataset with data about atoms
nn: входной набор данных с данными об атомах

source: size of batch
nn: размер батча

source: amount of training epochs
nn: количество эпох обучения

source: Calculates energy and forces for structs of atoms
nn: Вычисляет энергию и силы для структур атомов

source: positions of atoms
nn: позиции атомов

source: parameters of symmetric functions
nn: параметры симметричных функций

source: Saves trained model to file. It makes possible to load pre-trained net for calculations
nn: Сохраняет обученную модель в файл. Это позволяет загрузить предобученную сеть для расчетов

source: Bases: :py:class:`~torch.utils.data.dataset.Dataset`
nn: Базовые классы: :py:class:`~torch.utils.data.dataset.Dataset`

source: Create atomic dataset with symmetric functions.
nn: Создает атомный набор данных с симметричными функциями.

source: dictionary with positions by species, unit cell, forces and velocities.
nn: словарь с позициями по видам, ячейка, силы и скорости.

source: Returns
nn: Возвращает

source: dataset with symmetric functions.
nn: набор данных с симметричными функциями.

source: Return type
nn: Тип результата

source: Split dataset into train, validation, and test sets.
nn: Разделяет набор данных на обучающие, валидационные и тестовые наборы.

source: dataset to split
nn: набор данных для разделения

source: ratios of train, validation, and test sets
nn: соотношения обучающего, валидационного и тестового наборов

source: train, validation
nn: обучающий, валидационный
