Repository: ded-otshelnik/nnmd
Catalog: docs/locale/*/LC_MESSAGES/api/nnmd.io.po
Languages: ru

source: Module `nnmd.io` provides I/O utilities for parsing data for various formats.
ru: Модуль `nnmd.io` предоставляет утилиты ввода-вывода для разбора данных в различных форматах.

source: Package provides support for following formats:
ru: Пакет предоставляет поддержку следующих форматов:

source: GPAW input files (.txt)
ru: Файлы GPAW (.txt)

source: ASE trajectory files (.traj)
ru: Файлы траекторий ASE (.traj)

source: Parse info of gpaw simulation.
ru: Парсит информацию о симуляции GPAW.

source: Parameters
ru: Параметры

source: file of gpaw simulation.
ru: Файл симуляции GPAW.

source: Returns
ru: Возвращает

source: number of atoms, list of dictionaries with positions, forces and energy, unit cell and pbc.
ru: "число атомов, список словарей с позициями, силами и энергией, ячейка и периодические граничные условия (PBC).

source: Return type
ru: Результат

source: Parses input file with atomic data and neural network parameters. It supports json and yaml formats.
ru: Парсит входной файл с атомными данными и параметрами нейронной сети. Поддерживает форматы json и yaml.

source: Path to input file
ru: Путь к входному файлу

source: Raises
ru: Вызывает следующие исключения

source: Unsupported file format
ru: Неподдерживаемый формат файла

source: Parsed atomic data and neural network parameters.
ru: Обработанные атомные данные и параметры нейронной сети.

source: Extracts positions, energies, forces and velocities from ASE trajectory file with respect to each species.
ru: Извлекает позиции, энергии, силы и скорости из файла траектории ASE с учетом каждого сорта атомов.

source: ASE trajectory file.
ru: Файл траектории ASE.

source: number of atoms in each species, list of dictionaries with positions, forces, velocities and energies for each atomic structure, unit cell and pbc.
ru: число атомов в каждом виде, список словарей с позициями, силами, скоростями и энергиями для каждой атомной структуры, ячейка и периодические граничные условия (PBC).
