Repository: ded-otshelnik/nnmd
Catalog: docs/locale/*/LC_MESSAGES/api/nnmd.features.po
Languages: ru

source: Bases: :py:class:`~enum.Enum`
ru: Наследуется от: :py:class:`~enum.Enum

source: Enumeration of implemented symmetry functions. Each value corresponds to a specific type of symmetry function.
ru: Перечисление имплементированных функций симметрии. Каждое значение отвечает конкретному типу функции

source: Calculate pairwise distances with PBC.
ru: Вычисляет дистанции между парами атомов с учетом периодичных граничных условий (Periodic Boundary Conditions - PBC)

source: Parameters
ru: Параметры

source: torch.Tensor of shape (3, 3)
ru: torch.Tensor размерности (3, 3)

source: float - cutoff radius
ru: float - радиус отсечки

source: Returns
ru: Возвращает

source: torch.Tensor of shape (n_atoms, n_atoms)
ru: torch.Tensor размерности (n_atoms, n_atoms)

source: Calculate parameters for symmetry functions by auto-scheme for a given cutoff radius and number of functions.
ru: Вычисляет параметры для функций симметрии по автоматической схеме для данного радиуса отсечки и количества функций.

source: int - number of G1 functions
ru: int - количество функций G1

source: int - number of G2 functions
ru: int - количество функций G2

source: int - number of G3 functions
ru: int - количество функций G3

source: int - number of G4 functions
ru: int - количество функций G4

source: int - number of G5 functions
ru: int - количество функций G5

source: list of parameters for symmetry functions
ru: list - список параметров для функций симметрии

source: Calculate symmetry functions for a batch of atomic systems.
ru: Вычисляет функции симметрии для пакета атомных систем.

source: torch.Tensor of shape (n_batch, n_atoms, 3)
ru: torch.Tensor размерности (n_batch, n_atoms, 3)

source: torch.Tensor of shape (3, 3) - the three vectors defining unit cell
ru: torch.Tensor размерности (3, 3) - три вектора, определяющие ячейку

source: torch.Tensor of shape (3,) - periodic boundary conditions
ru: torch.Tensor размерности (3,) - периодические граничные условия

source: dict - dictionary with symmetry functions data
ru: dict - словарь с данными функций симметрии

source: torch.Tensor of shape (n_molecules, n_atoms, n_symm_funcs)
ru: torch.Tensor размерности (n_molecules, n_atoms, n_symm_funcs)

source: Calculate the cutoff function for the pair of atoms.
ru: Вычисляет функцию отсечки для пары атомов.

source: Calculate G1 symmetry functions for a pair of atoms.
ru: Вычисляет функции симметрии G1 для пары атомов.

source: torch.Tensor of shape (batch_size, n_atoms, n_atoms)
ru: torch.Tensor размерности (batch_size, n_atoms, n_atoms)

source: torch.Tensor of shape (batch_size, n_atoms)
ru: torch.Tensor размерности (batch_size, n_atoms)

source: Calculate G2 symmetry functions for a pair of atoms.
ru: Вычисляет функции симметрии G2 для пары атомов.

source: float - width of the Gaussian
ru: float - ширина гауссианы

source: float - center of the Gaussian
ru: float - центр гауссианы

source: Calculate G4 symmetry functions for a triplet of atoms.
ru: Вычисляет функции симметрии G4 для тройки атомов.

source: float - exponent of the cosine term
ru: float - экспонента косинуса

source: int - sign of the cosine term
ru: int - знак косинуса

source: Calculate G5 symmetry functions for a triplet of atoms.
ru: Вычисляет функции симметрии G5 для тройки атомов.
